Autodesk.Revit.DB.FabricationHostedInfo.PlaceOnHost(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double,System.Double)
Places the part on the specified host.
Remarks:
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
hostId:
Id of the host fabrication part.
hostConnector:
The connector of the host.
distance:
The distance from the connector to place the hosted part. Units are in feet (ft).
axisRotation:
The axis rotation in radians.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid fabrication part host. The host should be a straight fabrication part.
-or-
Invalid connector of fabrication part host.
-or-
The distance is out of range.
-or-
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.FabricationHostedInfo.PlaceOnHost(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double)
Places the part on the specified host.
Remarks:
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
hostId:
Id of the host fabrication part.
hostConnector:
The connector of the host.
distance:
The distance from the connector to place the hosted part. Units are in feet (ft).
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid fabrication part host. The host should be a straight fabrication part.
-or-
Invalid connector of fabrication part host.
-or-
The distance is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016